Feature: Вход в системата

Scenario: Вход в система с валидни данни
    Given Потребителят отваря екрана за вход в системата
    When  Потребителят въведе потребителското си име "Kostadin"
    And   Въведе парола "Password222"
    And   Натисне бутона за вход в системата
    Then  Вижда съобщение "OK".
    
Scenario: Вход в система с невалидни данни
    Given Потребителят отваря екрана за вход в системата
    When  Потребителят въведе потребителското си име "Kostadin"
    And   Въведе парола "Password222"
    And   Натисне бутона за вход в системата
    Then  Вижда съобщение "грешни потребителски данни".
    
Scenario: Вход в система без парола
    Given Потребителят отваря екрана за вход в системата
    When  Потребителят въведе потребителското си име "Kostadin"
    And   Натисне бутона за вход в системата
    Then  Вижда съобщение "Въведете парола".
    
Scenario: Вход в система без потребителско име
    Given Потребителят отваря екрана за вход в системата
    When  Въведе парола "Password222"
    And   Натисне бутона за вход в системата
    Then  Вижда съобщение "Въведете потребителско име".
    
Scenario: Вход в система без потребителски данни
    Given Потребителят отваря екрана за вход в системата
    And   Натисне бутона за вход в системата
    Then  Вижда съобщение "Въведете потребителско име и парола".
    
 
